## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.sfn_events_cloudquery will be created
  + resource "aws_cloudwatch_event_target" "sfn_events_cloudquery" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::794722365809:role/secopsAssetInventoryStateMachineRole"
      + rule           = "cloudquery"
      + target_id      = (known after apply)
    }

  # aws_sfn_state_machine.asset_inventory_cloudquery will be created
  + resource "aws_sfn_state_machine" "asset_inventory_cloudquery" {
      + arn           = (known after apply)
      + creation_date = (known after apply)
      + definition    = <<-EOT
            {
              "Comment": "Run daily asset inventory of cloud assets",
              "TimeoutSeconds": 86400,
              "StartAt": "CloudQuery",
              "States": {
                "CloudQuery": {
                  "Type": "Task",
                  "Resource": "arn:aws:states:::ecs:runTask",
                  "Parameters": {
                    "Cluster": "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery",
                    "LaunchType": "FARGATE",
                    "TaskDefinition": "arn:aws:ecs:ca-central-1:794722365809:task-definition/cloudquery:1",
                    "Overrides": {
                      "ContainerOverrides": [
                        {
                          "Name": "cloudquery",
                          "Environment": [
                            {
                              "Name": "CQ_S3_BUCKET",
                              "Value": "security-tools-794722365809-cloudquery-results"
                            }
                          ]
                        }
                      ]
                    },
                    "NetworkConfiguration": {
                      "AwsvpcConfiguration": {
                        "SecurityGroups": ["sg-03caf974f268a3efb"],
                        "Subnets": [""subnet-08cab5daf34489c53", "subnet-07f8e17bbf11b0797", "subnet-0d92713028fd15243""]
                      }
                    }
                  },
                  "Retry": [
                    {
                      "ErrorEquals": [
                        "ECS.AmazonECSException"
                      ],
                      "IntervalSeconds": 300,
                      "MaxAttempts": 4,
                      "BackoffRate": 2
                    }
                  ],
                  "Catch": [
                    {
                      "ErrorEquals": [
                        "States.ALL"
                      ],
                      "ResultPath": null,
                      "Next": "Handle Failure"
                    }
                  ],
                  "End": true
                },
                "Handle Failure": {
                  "Type": "Pass",
                  "End": true
                }
              }
            }
        EOT
      + id            = (known after apply)
      + name          = "asset-inventory-cloudquery"
      + name_prefix   = (known after apply)
      + role_arn      = "arn:aws:iam::794722365809:role/secopsAssetInventoryStateMachineRole"
      + status        = (known after apply)
      + tags          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + type          = "STANDARD"

      + logging_configuration {
          + include_execution_data = (known after apply)
          + level                  = (known after apply)
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cloudquery_s3_bucket.aws_s3_bucket.this,
  on .terraform/modules/cloudquery_s3_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.list_accounts_in_org"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
